{
    "Date received": {
        "191253": "2023-03-08",
        "1061867": "2022-03-08"
    },
    "Product": {
        "191253": "Checking or savings account",
        "1061867": "Debt collection"
    },
    "Sub-product": {
        "191253": "Checking account",
        "1061867": "Other debt"
    },
    "Issue": {
        "191253": "Closing an account",
        "1061867": "Attempts to collect debt not owed"
    },
    "Sub-issue": {
        "191253": "Funds not received from closed account",
        "1061867": "Debt was result of identity theft"
    },
    "Consumer complaint narrative": {
        "191253": "Bank of America closed out my business account and have refused to send out the balance on my account of over {$80000.00}. They have been doing this to a lot of people and it has to be illegal for the bank to close an account and hold on to funds that do not rightfuly belong to them,",
        "1061867": "I moved into an apartment in XXXX XXXX XXXX XXXX  called XXXX XXXX and a few months after moving in I went home to XXXX  for 2 weeks for a family emergency. I had gotten a call from a neighbor next door that they were several people in my unit. I called the 24 hour security the second I found out and he went right to the unit and a female opened the door while I was on the phone with him. \nHe specifically asked her if she was ( my name ) she replied with yes. They did not make her show ID to prove her identity. I called the police, I called the property several times and there was nothing anyone could do to get her out. I turned off electric to try to run her out. Then very rudely was notified the next day by the office that Im not allowed to turn it off during an active lease so the property had it turned it on again through there company name. I was exchanging emails and phone calls with the company and nothing was done. With signed permission from me to the property through email, I had a friend go to my unit to make sure nothing was damaged. She had to give her ID in exchange for keys to the unit. This was allowing her to go in to make sure things are OK on my behalf. When she was in the unit, all my furniture, TVs, kitchen goods, everything had been gone. Im told I owe over {$8000.00} to this company. I have been fighting for years. I stopped all communication with them as they are not helpful. Always told nothing can be done due to squatters rights but what about my rights as a tenet. They did not protect my unit knowing there was nothing I could do while away. This place has caused me nothing but trouble. I have made police reports hoping it would help resolve the issue."
    },
    "Company public response": {
        "191253": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
        "1061867": null
    },
    "Company": {
        "191253": "BANK OF AMERICA, NATIONAL ASSOCIATION",
        "1061867": "National Credit Systems,Inc."
    },
    "State": {
        "191253": "TX",
        "1061867": "MA"
    },
    "ZIP code": {
        "191253": "77032",
        "1061867": "01877"
    },
    "Tags": {
        "191253": null,
        "1061867": null
    },
    "Consumer consent provided?": {
        "191253": "Consent provided",
        "1061867": "Consent provided"
    },
    "Submitted via": {
        "191253": "Web",
        "1061867": "Web"
    },
    "Date sent to company": {
        "191253": "2023-03-08",
        "1061867": "2022-03-08"
    },
    "Company response to consumer": {
        "191253": "Closed with explanation",
        "1061867": "Closed with explanation"
    },
    "Timely response?": {
        "191253": "Yes",
        "1061867": "Yes"
    },
    "Consumer disputed?": {
        "191253": null,
        "1061867": null
    },
    "Complaint ID": {
        "191253": 6667397,
        "1061867": 5297793
    }
}